using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Toolkit
{
    class Symbol
    {
        /// <summary>
        /// 常用字符
        /// </summary>
        private const string CYFH = @"❤❥웃유♋☮✌☏☢☠✔☑♚▲♪✈✞÷↑↓◆◇⊙■□△▽¿─
                                        │♥❣♂♀☿Ⓐ✍✉☣☤✘☒♛▼♫⌘☪≈←→◈◎☉★☆⊿※¡━
                                        ┃♡ღツ☼☁❅♒✎©®™Σ✪✯☭➳卐√↖↗●◐Θ◤◥︻〖〗┄
                                        ┆℃℉°✿ϟ☃☂✄¢€£∞✫★½✡×↙↘○◑⊕◣◢︼【】┅
                                        ┇☽☾✚〓▂▃▄▅▆▇█▉▊▋▌▍▎▏↔↕☽☾の•▸◂▴▾┈
                                        ┊①②③④⑤⑥⑦⑧⑨⑩ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩ㍿▓♨♛❖♓☪
                                        ✙┉┋☹☺☻تヅツッシÜϡﭢ™℠℗©®♥❤❥❣❦❧♡۵웃유ღ♋♂♀☿
                                        ☼☀☁☂☄☾☽❄☃☈⊙☉℃℉❅✺ϟ☇♤♧♡♢♠♣♥♦☜☞☝✍☚
                                        ☛☟✌✽✾✿❁❃❋❀⚘☑✓✔√☐☒✗✘ㄨ✕✖✖⋆✢✣✤✥❋✦✧✩✰
                                        ✪✫✬✭✮✯❂✡★✱✲✳✴✵✶✷✸✹✺✻✼❄❅❆❇❈❉❊†☨✞✝☥☦☓
                                        ☩☯☧☬☸✡♁✙♆。，、＇：∶；?‘’“”〝〞ˆˇ﹕︰﹔﹖﹑•¨…
                                        .¸;！´？！～—ˉ｜‖＂〃｀@﹫¡¿﹏﹋﹌︴々
                                        ﹟#﹩$﹠&﹪%*﹡﹢﹦﹤‐￣¯―﹨ˆ˜﹍﹎+=<＿_-
                                        \ˇ~﹉﹊（）〈〉‹›﹛﹜『』〖〗［］《》〔〕{}「」
                                        【】︵︷︿︹︽_﹁﹃︻︶︸﹀︺︾ˉ﹂﹄︼☩☨☦✞✛✜
                                        ✝✙✠✚†‡◉○◌◍◎●◐◑◒◓◔◕◖◗❂☢⊗⊙◘◙◍⅟
                                        ½⅓⅕⅙⅛⅔⅖⅚⅜¾⅗⅝⅞⅘≂≃≄≅≆≇≈≉≊≋≌≍≎≏
                                        ≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟≠≡≢≣≤≥≦≧≨≩⊰⊱⋛⋚
                                        ∫∬∭∮∯∰∱∲∳%℅‰‱㊣㊎㊍㊌㊋㊏㊐㊊㊚㊛㊤㊥㊦㊧
                                        ㊨㊒㊞㊑㊒㊓㊔㊕㊖㊗㊘㊜㊝㊟㊠㊡㊢㊩㊪㊫㊬㊭㊮㊯㊰㊙㉿
                                        囍♔♕♖♗♘♙♚♛♜♝♞♟ℂℍℕℙℚℝℤℬℰℯℱℊℋℎℐ
                                        ℒℓℳℴ℘ℛℭ℮ℌℑℜℨ♪♫♩♬♭♮♯°øⒶ☮✌☪✡☭✯卐✐✎✏
                                        ✑✒✍✉✁✂✃✄✆✉☎☏➟➡➢➣➤➥➦➧➨➚➘➙➛➜➝➞➸♐
                                        ➲➳⏎➴➵➶➷➸➹➺➻➼➽←↑→↓↔↕↖↗↘↙↚↛↜↝↞↟↠↡
                                        ↢↣↤↥↦↧↨➫➬➩➪➭➮➯➱↩↪↫↬↭↮↯↰↱↲↳↴↵↶↷↸↹↺↻↼↽
                                        ↾↿⇀⇁⇂⇃⇄⇅⇆⇇⇈⇉⇊⇋⇌⇍⇎⇏⇐⇑⇒⇓⇔⇕⇖⇗⇘⇙⇚⇛⇜⇝⇞⇟⇠⇡⇢⇣
                                        ⇤⇥⇦⇧⇨⇩⇪➀➁➂➃➄➅➆➇➈➉➊➋➌➍➎➏➐➑➒➓㊀㊁㊂
                                        ㊃㊄㊅㊆㊇㊈㊉ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌ
                                        ⓍⓎⓏⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ⒜
                                        ⒝⒞⒟⒠⒡⒢⒣⒤⒥⒦⒧⒨⒩⒪⒫⒬⒭⒮⒯⒰⒱⒲⒳⒴⒵ⅠⅡⅢⅣⅤ
                                        ⅥⅦⅧⅨⅩⅪⅫⅬⅭⅮⅯⅰⅱⅲⅳⅴⅵⅶⅷⅸⅹⅺⅻⅼⅽⅾⅿ┌┍┎┏┐┑┒┓
                                        └┕┖┗┘┙┚┛├┝┞┟┠┡┢┣┤┥┦┧┨┩┪┫┬┭┮┯┰┱┲┳
                                        ┴┵┶┷┸┹┺┻┼┽┾┿╀╁╂╃╄╅╆╇╈╉╊╋╌╍╎╏═║╒╓
                                        ╔╕╖╗╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬◤◥◄►▶◀◣
                                        ◢▲▼◥▸◂▴▾△▽▷◁⊿▻◅▵▿▹◃❏❐❑❒▀▁▂▃▄▅▆▇▉▊▋
                                        █▌▍▎▏▐░▒▓▔▕■□▢▣▤▥▦▧▨▩▪▫▬▭▮▯
                                        ㋀㋁㋂㋃㋄㋅㋆㋇㋈㋉㋊㋋㏠㏡㏢㏣㏤㏥㏦㏧㏨㏩㏪㏫㏬㏭㏮㏯㏰㏱㏲㏳㏴㏵㏶㏷㏸㏹㏺㏻㏼㏽㏾
                                        ㍙㍚㍛㍜㍝㍞㍟㍠㍡㍢㍣㍤㍥㍦㍧㍨㍩㍪㍫㍬㍭㍮㍯㍰㍘☰☲☱☴☵☶☳☷☯";
        /// <summary>
        /// 特殊字符
        /// </summary>
        private const string TSFH = @"♠♣♧♡♥❤❥❣♂♀✲☀☼☾☽◐◑☺☻☎☏✿❀№↑↓←→√×÷★℃℉°◆◇⊙■□△▽¿½☯✡㍿卍卐♂
                                        ♀✚〓㎡♪♫♩♬㊚㊛囍㊒㊖Φ♀♂‖$@*&#※卍卐Ψ♫♬♭♩♪♯♮⌒¶∮‖€￡¥$";

        /// <summary>
        /// 编号字符
        /// </summary>
        private const string BHFH = @"①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳⓪
                                        ❶❷❸❹❺❻❼❽❾❿⓫⓬⓭⓮⓯⓰⓱⓲⓳⓴
                                        ㊀㊁㊂㊃㊄㊅㊆㊇㊈㊉㈠㈡㈢㈣㈤㈥㈦㈧㈨㈩
                                        ⑴⑵⑶⑷⑸⑹⑺⑻⑼⑽⑾⑿⒀⒁⒂⒃⒄⒅⒆⒇
                                        ⒈⒉⒊⒋⒌⒍⒎⒏⒐⒑⒒⒓⒔⒕⒖⒗⒘⒙⒚⒛
                                        ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩⅪⅫⅰⅱⅲⅳⅴⅵⅶⅷⅸⅹ
                                        ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ
                                        ⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ
                                        ⒜⒝⒞⒟⒠⒡⒢⒣⒤⒥⒦⒧⒨⒩⒪⒫⒬⒭⒮⒯⒰⒱⒲⒳⒴⒵";
        /// <summary>
        /// 数字字符
        /// </summary>
        private const string SZFH = @"﹢﹣×÷±/=≌∽≦≧≒﹤﹥≈≡≠=≤≥<>≮≯∷∶
                                        ∫∮∝∞∧∨∑∏∪∩∈∵∴⊥∥∠⌒⊙√∟⊿㏒㏑%‰
                                        ⅟½⅓⅕⅙⅛⅔⅖⅚⅜¾⅗⅝⅞⅘≂≃≄≅≆≇≈≉≊≋≌
                                        ≍≎≏≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟≠≡≢≣≤≥≦≧≨≩⊰⊱⋛⋚
                                        ∫∬∭∮∯∰∱∲∳%℅‰‱øØπ";
        /// <summary>
        /// 爱心
        /// </summary>
        private const string AXFH = @"♥❣ღ♠♡♤❤❥";
        /// <summary>
        ///  标点
        /// </summary>
        private const string BDFH = @"。，、＇：∶；?‘’“”〝〞ˆˇ﹕︰﹔﹖﹑•¨….¸;！´？！
                                        ～—ˉ｜‖＂〃｀@﹫¡¿﹏﹋﹌︴々﹟#﹩$﹠&﹪%*﹡
                                        ﹢﹦﹤‐￣¯―﹨ˆ˜﹍﹎+=<＿_-\ˇ~﹉﹊（）〈〉‹›﹛﹜
                                        『』〖〗［］《》〔〕{}「」【】︵︷︿︹︽_﹁﹃︻
                                        ︶︸﹀︺︾ˉ﹂﹄︼❝❞";
        /// <summary>
        /// 单位
        /// </summary>
        private const string DWFH = @"°′″＄￥〒￠￡％＠℃℉﹩﹪‰﹫㎡㏕㎜㎝㎞㏎m³㎎㎏㏄º○¤%$º¹²³";
        /// <summary>
        /// 货币
        /// </summary>
        private const string HBFH = @"€£Ұ₴$₰¢₤¥₳₲₪₵元₣₱฿¤₡₮₭₩ރ円₢₥₫₦zł﷼₠₧₯₨Kčर₹ƒ₸￠";
        /// <summary>
        /// 箭头
        /// </summary>
        private const string JTFH = @"↑↓←→↖↗↘↙↔↕➻➼➽➸➳➺➻➴➵➶➷➹▶►▷◁◀◄
                                        «»➩➪➫➬➭➮➯➱⏎➲➾➔➘➙➚➛➜➝➞➟➠➡➢➣➤➥➦➧➨
                                        ↚↛↜↝↞↟↠↠↡↢↣↤↤↥↦↧↨⇄⇅⇆⇇⇈⇉⇊⇋⇌⇍⇎⇏⇐⇑⇒⇓⇔⇖⇗⇘⇙
                                        ⇜↩↪↫↬↭↮↯↰↱↲↳↴↵↶↷↸↹☇☈↼↽↾↿⇀⇁⇂⇃⇞⇟⇠⇡⇢⇣⇤⇥⇦⇧⇨⇩⇪↺↻⇚⇛♐";
        /// <summary>
        /// 符号图案
        /// </summary>
        private const string FHTAFH = @"✐✎✏✑✒✍✉✁✂✃✄✆✉☎☏
                                        ☑✓✔√☐☒✗✘ㄨ✕✖✖☢☠☣✈★☆✡囍㍿☯
                                        ☰☲☱☴☵☶☳☷☜☞☝✍☚☛☟✌♤♧♡♢♠♣♥♦
                                        ☀☁☂❄☃♨웃유❖☽☾☪✿♂♀✪✯☭➳卍卐√×
                                        ■◆●○◐◑✙☺☻❀⚘♔♕♖♗♘♙♚♛♜♝♞♟
                                        ♧♡♂♀♠♣♥❤☜☞☎☏⊙◎☺☻☼▧▨♨◐◑↔↕
                                        ▪▒◊◦▣▤▥▦▩◘◈◇♬♪♩♭♪の★☆→あぃ￡Ю〓
                                        §♤♥▶¤✲❈✿✲❈➹☀☂☁【】┱┲❣✚✪✣✤✥✦
                                        ❉❥❦❧❃❂❁❀✄☪☣☢☠☭ღ▶▷◀◁☀☁☂☃☄★☆
                                        ☇☈⊙☊☋☌☍ⓛⓞⓥⓔ╬『』∴☀♫♬♩♭♪☆∷﹌の★
                                        ◎▶☺☻►◄▧▨♨◐◑↔↕↘▀▄█▌◦☼♪の☆→♧ぃ￡
                                        ❤▒▬♦◊◦♠♣▣۰•❤•۰►◄▧▨♨◐◑↔↕▪▫☼♦⊙●○①
                                        ⊕◎Θ⊙¤㊣★☆♀◆◇◣◢◥▲▼△▽⊿◤◥✐✌✍✡✓✔✕✖
                                        ♂♀♥♡☜☞☎☏⊙◎☺☻►◄▧▨♨◐◑↔↕♥♡▪▫☼♦▀▄█▌
                                        ▐░▒▬♦◊◘◙◦☼♠♣▣▤▥▦▩◘◙◈♫♬♪♩♭♪✄☪☣☢☠♯♩
                                        ♪♫♬♭♮☎☏☪♈ºº₪¤큐«»™♂✿♥　◕‿-｡　｡◕‿◕｡";
        /// <summary>
        /// 希腊字母
        /// </summary>
        private const string XLFH = @"ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ
                                        αβγδεζνξοπρσηθικλμτυφχψω";
        /// <summary>
        /// 俄语
        /// </summary>
        private const string EYFH = @"АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ
                                        абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
        /// <summary>
        /// 汉语拼音
        /// </summary>
        private const string HYFH = @"āáǎàōóǒòēéěèīíǐìūúǔùǖǘǚǜüêɑńňɡ
                                        ㄅㄆㄇㄈㄉㄊㄋㄌㄍㄎㄏㄐㄑㄒㄓㄔㄕㄖㄗㄘㄙㄚㄛㄜㄝㄞㄟㄠㄡㄢㄣㄤㄥㄦㄧㄨㄩ";
        ///中文字符
        private const string ZWFH = @"零壹贰叁肆伍陆柒捌玖拾佰仟万亿吉太拍艾分厘毫微卍卐卄巜弍弎弐朤氺曱甴囍兀
                                        々〆のぁ〡〢〣〤〥〦〧〨〩㊎㊍㊌㊋㊏㊚㊛㊐㊊㊣㊤㊥㊦㊧㊨㊒
                                        ㊫㊑㊓㊔㊕㊖㊗㊘㊜㊝㊞㊟㊠㊡㊢㊩㊪㊬㊭㊮㊯㊰
                                        ㊀㊁㊂㊃㊄㊅㊆㊇㊈㊉";
        /// <summary>
        /// 日文
        /// </summary>
        private const string JPFH = @"ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじ
                                        すずせぜそぞただちぢっつづてでとどなにぬね
                                        のはばぱひびぴふぶぷへべぺほぼぽまみむめも
                                        ゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ
                                        ァアィイゥウェエォオカガキギクグケゲコゴ
                                        サザシジスズセゼソゾタダチヂッツヅテデ
                                        トドナニヌネノハバパヒビピフブプヘベペホボポ
                                        マミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵ
                                        ヶヷヸヹヺ・ーヽヾヿ゠ㇰㇱㇲㇳㇴㇵㇶㇷㇸㇹㇺㇻㇼㇽㇾㇿ";
        /// <summary>
        /// tab
        /// </summary>
        private const string TABFH = @"─ ━│┃╌╍╎╏┄ ┅┆┇┈ ┉┊┋┌┍┎┏┐┑┒┓
                                        └ ┕┖┗ ┘┙┚┛├┝┞┟┠┡┢┣ ┤┥┦┧┨┩┪┫
                                        ┬ ┭ ┮ ┯ ┰ ┱ ┲ ┳ ┴ ┵ ┶ ┷ ┸ ┹ ┺ ┻┼ 
                                        ┽ ┾ ┿ ╀ ╁ ╂ ╃ ╄ ╅ ╆ ╇ ╈ ╉ ╊ ╋ ╪ ╫ 
                                        ╬═║╒╓╔ ╕╖╗╘╙╚ ╛╜╝╞╟╠ ╡╢╣╤ ╥
                                        ╦ ╧ ╨ ╩ ╳╔ ╗╝╚ ╬ ═ ╓ ╩ ┠ ┨┯ ┷┏ ┓
                                        ┗ ┛┳ ⊥ ﹃ ﹄┌ ╮ ╭ ╯╰";
        /// <summary>
        /// crown 皇冠
        /// </summary>
        private static string CROWNFH = @"♚　♛　♝　♞　♜　♟　♔　♕　♗　♘　♖　♟";
        /// <summary>
        /// Emoji
        /// </summary>
        private const string EmojiFH = @"🌹🍀🍎💰📱🌙🍁🍂🍃🌷💎🔫🏀⚽⚡👄🔥🌹🍀🍎💰📱🌙🍁🍂🍃🌷💎🔪🔫🏀⚽⚡👄👍🔥
                                        😁😂😃😄😅😆😉😊😋😎😍😘😚☺😇
                                        😐😶😏😣😥😪😫😌😜😝😒😓😔😲😷😖
                                        😞😤😢😭😨😰😱😳😵😡😠😈👿👹👺💀
                                        👻👽👦👧👨👩👴👵👶👱👮👲👳👷👸💂
                                        🎅👰👼💆💇🙍🙎🙅🙆💁🙋🙇🙌🙏👤
                                        🚶🏃👯💃👫💏💑👪💪👈👉☝👆👇✌
                                        ✋👌👍👎✊👊👋👏👐✍👣👀👂👃
                                        👅👄💋👓👔👕👖👗👘👙👚👛👜👝
                                        🎒💼👞👟👠👡👢👑👒🎩🎓💄💅💍🌂
                                        🙈🙉🙊🐵🐒🐶🐩🐺🐱😺😸😹😻😼😽🙀😿😾
                                        🐯🐴🐎🐮🐷🐗🐽🐑🐫🐘🐭🐹🐰🐻🐨🐼🐾🐔
                                        🐣🐤🐥🐦🐧🐸🐢🐍🐲🐳🐬🐟🐠🐡🐙🐚🐌🐛🐜🐝🐞
                                        💐🌸💮🌹🌺🌻🌼🌷🌱🌴🌵🌾🌿🍀🍁🍂🍃🌏🌑🌓🌔🌕
                                        🌙🌛☀⭐🌟🌠☁⛅☔⚡❄🔥💧🌊💩🍇🍈🍉🍊🍌🍍
                                        🍎🍏🍑🍒🍓🍅🍆🌽🍄🌰🍞🍖🍗🍔🍟🍕🍳🍲🍱🍘🍙
                                        🍚🍛🍜🍝🍠🍢🍣🍤🍥🍡🍦🍧🍨🍩🍪🎂🍰🍫🍬🍭🍮🍯
                                        ☕🍵🍶🍷🍸🍹🍺🍻🍴🎪🎭🎨🎰🚣🛀🎫🏆⚽⚾🏀🏈🎾🎱🎳⛳🎣🎽🎿🏂🏄🏊
                                        🎯🎮🎲🎷🎸🎺🎻🎬👾🌋🗻🏠🏡🏢🏣🏥🏦🏨🏩🏪🏫🏬🏭🏯🏰💒🗼🗽⛪⛲
                                        🌁🌃🌆🌇🌉🌌🎠🎡🎢🚃🚄🚅🚇🚉🚌🚏🚑🚒🚓🚕🚗🚚🚲⛽🚨🚥🚧⚓⛵🚤🚢✈💺
                                        🚀🎑🗿💌💎🔪💈🚪🚽⌛⏳⌚⏰🎈🎉🎊🎎🎏🎐🎀🎁📯📻📱📲☎📞📟📠🔋🔌💻💽💾💿
                                        📀🎥📺📷📹📼🔍🔎📡💡🔦🏮📔📕📖📗📘📙📚📓📃📜📄📰📑🔖💰💴💵💸💳✉📧📨📩📤📥📦📫📪
                                        📮✏✒📝📁📂📅📆📇📈📉📊📋📌📍📎📏📐✂🔒🔓🔏🔐🔑🔨🔫🔧🔩🔗💉💊🚬🔮🚩🎌💦💨💣☠♠♥♦♣🀄🎴
                                        🔊📢📣💤💢💬♨🌀🔔✡✝🔯📛🔰🔱⭕✅☑✔✖❌❎➕➖➗➰➿〽✳✴❇‼⁉❓❔❕❗©®™🎦💯🔠🔡🔢🔣🔤🅰🆎🅱
                                        🆑🆒🆓ℹ🆔Ⓜ🆕🆖🅾🆗🅿🆘🆙🆚🈁🈂🈷🈶🈯🉐🈹🈚🈲🉑🈸🈴🈳㊗㊙🈺🈵▪▫◻◼◽◾⬛⬜🔶🔷🔸🔹🔺🔻💠🔲🔳
                                        ⚪⚫🔴🔵♈♉♊♋♌♍♎♏♐♑♒♓⛎💘❤💓💔💕💖💗💙💚💛💜💝💞💟❣🌿🚧💒☎📟💽⬆↗➡↘⬇↙⬅↖↕↔↩↪⤴⤵
                                        🔃🔄🔙🔚🔛🔜🔝▶⏩◀⏪🔼⏫🔽⏬📱📶📳📴♻🏧♿🚹🚺🚻🚼🚾⚠⛔🚫🚭🔞";

        public static string GetSymbol(string Type)
        {
            string result = "";
            switch (Type)
            {
                case "常用符号大全":
                    result = CYFH;
                    break;
                case "特殊符号":
                    result =TSFH;
                    break;
                case "编号符号":
                    result = BHFH;
                    break;
                case "数学符号":
                    result = SZFH;
                    break;
                case "爱心符号":
                    result = AXFH;
                    break;
                case "标点符号":
                    result = BDFH;
                    break;
                case "单位符号":
                    result = DWFH;
                    break;
                case "货币符号":
                    result = HBFH;
                    break;
                case "箭头符号":
                    result = JTFH;
                    break;
                case "符号图案":
                    result = FHTAFH;
                    break;
                case "希腊字母":
                    result = XLFH;
                    break;
                case "俄语字母":
                    result = EYFH;
                    break;
                case "汉语拼音":
                    result = HYFH;
                    break;
                case "中文字符":
                    result = ZWFH;    
                    break;
                case "日文平假名片假名":
                    result = JPFH;
                    break;    
                case "制表符":
                    result = TABFH;
                    break;
                case "皇冠符号":
                    result = CROWNFH;
                    break;
                case "emoji符号":
                    result = EmojiFH;
                    break;
                default:
                    break;
            }
            return result;

        }



    }
}
